export const CREW_MESSAGES = {
  LOADING: {
    DELETE_CREW: "กำลังลบข้อมูลทีมงาน...",
    SAVE_CREW: "กำลังบันทึกข้อมูลทีมงาน...",
    SUB_DELETE_CREW: "กรุณารอสักครู่ ระบบกำลังลบข้อมูลทีมงานออกจากระบบ",
    SUB_SAVE_CREW: "กรุณารอสักครู่ ระบบกำลังอัปโหลดข้อมูลและรูปภาพทีมงาน",
  },
  TOAST: {
    EDIT_CREW_SUCCESS: "แก้ไขข้อมูลทีมงานเรียบร้อยแล้ว",
    ADD_CREW_SUCCESS: "เพิ่มข้อมูลทีมงานเรียบร้อยแล้ว",
    DELETE_CREW_SUCCESS: "ลบข้อมูลทีมงานเรียบร้อยแล้ว",
    REQUIRED_NAME: "กรุณากรอกชื่อทีมงาน",
  },
  CONFIRM: {
    DELETE_CREW_TITLE: "ยืนยันการลบ",
    DELETE_CREW_MSG:
      "การดำเนินการนี้จะเป็นแบบถาวรและไม่สามารถกู้คืนได้ การลบรายชื่อนี้อาจส่งผลต่อข้อมูลของภาพยนตร์เรื่องอื่นๆ ที่ทีมงานท่านนี้มีส่วนร่วมอยู่",
    DELETE_CREW_BTN: "ลบรายชื่อทีมงาน",
    EDIT_CREW_TITLE: "ยืนยันการแก้ไข",
    ADD_CREW_TITLE: "ยืนยันการเพิ่ม",
    EDIT_CREW_MSG: (name: string) =>
      `คุณแน่ใจหรือไม่ว่าต้องการบันทึกการแก้ไขข้อมูลของ "${name}"?`,
    ADD_CREW_MSG: (name: string) =>
      `คุณแน่ใจหรือไม่ว่าต้องการเพิ่มรายชื่อ "${name}" เข้าสู่ระบบคลัง?`,
  },
  COMMON: {
    CONTRIBUTION: (count: number) => `มีส่วนร่วมภาพยนตร์ ${count} เรื่อง`,
  },
} as const;
